Masmiseim36/nxpSDK/devices/MK28F15/cmsis_drivers/fsl_dspi_cmsis.c
static ARM_SPI_STATUS DSPI0_EdmaGetStatus(void)
{
    return DSPI_EdmaGetStatus(&DSPI0_EdmaDriverState);
}

#endif

#else
cmsis_dspi_handle_t DSPI0_Handle;

#if defined(__CC_ARM)
ARMCC_SECTION("dspi0_interrupt_driver_state")
cmsis_dspi_interrupt_driver_state_t DSPI0_InterruptDriverState = {
#else
cmsis_dspi_interrupt_driver_state_t DSPI0_InterruptDriverState = {
#endif
    &DSPI0_Resource, &DSPI0_Handle,
};

static int32_t DSPI0_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    DSPI0_InitPins();
    return DSPI_InterruptInitialize(cb_event, &DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptUninitialize(void)
{
    DSPI0_DeinitPins();
    return DSPI_InterruptUninitialize(&DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptPowerControl(ARM_POWER_STATE state)
{
    return DSPI_InterruptPowerControl(state, &DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptSend(const void *data, uint32_t num)
{
    return DSPI_InterruptSend(data, num, &DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptReceive(void *data, uint32_t num)
{
    return DSPI_InterruptReceive(data, num, &DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return DSPI_InterruptTransfer(data_out, data_in, num, &DSPI0_InterruptDriverState);
}

static uint32_t DSPI0_InterruptGetCount(void)
{
    return DSPI_InterruptGetCount(&DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptControl(uint32_t control, uint32_t arg)
{
    return DSPI_InterruptControl(control, arg, &DSPI0_InterruptDriverState);
}

static ARM_SPI_STATUS DSPI0_InterruptGetStatus(void)
{
    return DSPI_InterruptGetStatus(&DSPI0_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI0 = {DSPIx_GetVersion,     DSPIx_GetCapabilities,
#if RTE_SPI0_DMA_EN
                              DSPI0_EdmaInitialize, DSPI0_EdmaUninitialize, DSPI0_EdmaPowerControl, DSPI0_EdmaSend,
                              DSPI0_EdmaReceive,    DSPI0_EdmaTransfer,     DSPI0_EdmaGetCount,     DSPI0_EdmaControl,
                              DSPI0_EdmaGetStatus
#else
                              DSPI0_InterruptInitialize, DSPI0_InterruptUninitialize, DSPI0_InterruptPowerControl,
                              DSPI0_InterruptSend, DSPI0_InterruptReceive, DSPI0_InterruptTransfer,
                              DSPI0_InterruptGetCount, DSPI0_InterruptControl, DSPI0_InterruptGetStatus
#endif
};

#endif /*  DSPI0  */

#if defined(DSPI1) && RTE_SPI1

/* User needs to provide the implementation for DSPI1_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t DSPI1_GetFreq(void);
extern void DSPI1_InitPins(void);
extern void DSPI1_DeinitPins(void);

cmsis_dspi_resource_t DSPI1_Resource = {DSPI1, 1, DSPI1_GetFreq};

#if RTE_SPI1_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
cmsis_dspi_edma_resource_t DSPI1_EdmaResource = {
    RTE_SPI1_DMA_TX_DMA_BASE,   RTE_SPI1_DMA_TX_CH,  RTE_SPI1_DMA_TX_DMAMUX_BASE, RTE_SPI1_DMA_TX_PERI_SEL,

    RTE_SPI1_DMA_RX_DMA_BASE,   RTE_SPI1_DMA_RX_CH,  RTE_SPI1_DMA_RX_DMAMUX_BASE, RTE_SPI1_DMA_RX_PERI_SEL,

    RTE_SPI1_DMA_LINK_DMA_BASE, RTE_SPI1_DMA_LINK_CH};

cmsis_dspi_edma_handle_t DSPI1_EdmaHandle;

edma_handle_t DSPI1_EdmaRxRegToRxDataHandle;
edma_handle_t DSPI1_EedmaTxDataToIntermediaryHandle;
edma_handle_t DSPI1_EedmaIntermediaryToTxRegHandle;
edma_handle_t DSPI1_EedmaTxDataToTxRegHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("dspi1_edma_driver_state")
cmsis_dspi_edma_driver_state_t DSPI1_EdmaDriverState = {
#else
cmsis_dspi_edma_driver_state_t DSPI1_EdmaDriverState = {
#endif
    &DSPI1_Resource,
    &DSPI1_EdmaResource,
    &DSPI1_EdmaHandle,
    &DSPI1_EdmaRxRegToRxDataHandle,
    &DSPI1_EedmaTxDataToIntermediaryHandle,
    &DSPI1_EedmaIntermediaryToTxRegHandle,
    &DSPI1_EedmaTxDataToTxRegHandle,
};

static int32_t DSPI1_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    DSPI1_InitPins();
    return DSPI_EdmaInitialize(cb_event, &DSPI1_EdmaDriverState);
}

static int32_t DSPI1_EdmaUninitialize(void)
{
    DSPI1_DeinitPins();
    return DSPI_EdmaUninitialize(&DSPI1_EdmaDriverState);
}

static int32_t DSPI1_EdmaPowerControl(ARM_POWER_STATE state)
{
    return DSPI_EdmaPowerControl(state, &DSPI1_EdmaDriverState);
}

static int32_t DSPI1_EdmaSend(const void *data, uint32_t num)
{
    return DSPI_EdmaSend(data, num, &DSPI1_EdmaDriverState);
}

static int32_t DSPI1_EdmaReceive(void *data, uint32_t num)
{
    return DSPI_EdmaReceive(data, num, &DSPI1_EdmaDriverState);
}

static int32_t DSPI1_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return DSPI_EdmaTransfer(data_out, data_in, num, &DSPI1_EdmaDriverState);
}

static uint32_t DSPI1_EdmaGetCount(void)
{
    return DSPI_EdmaGetCount(&DSPI1_EdmaDriverState);
}

static int32_t DSPI1_EdmaControl(uint32_t control, uint32_t arg)
{
    return DSPI_EdmaControl(control, arg, &DSPI1_EdmaDriverState);
}

static ARM_SPI_STATUS DSPI1_EdmaGetStatus(void)
{
    return DSPI_EdmaGetStatus(&DSPI1_EdmaDriverState);
}

#endif

#else

cmsis_dspi_handle_t DSPI1_Handle;

#if defined(__CC_ARM)
ARMCC_SECTION("dspi1_interrupt_driver_state")
cmsis_dspi_interrupt_driver_state_t DSPI1_InterruptDriverState = {
#else
cmsis_dspi_interrupt_driver_state_t DSPI1_InterruptDriverState = {
#endif
    &DSPI1_Resource, &DSPI1_Handle,
};

static int32_t DSPI1_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    DSPI1_InitPins();
    return DSPI_InterruptInitialize(cb_event, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptUninitialize(void)
{
    DSPI1_DeinitPins();
    return DSPI_InterruptUninitialize(&DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptPowerControl(ARM_POWER_STATE state)
{
    return DSPI_InterruptPowerControl(state, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptSend(const void *data, uint32_t num)
{
    return DSPI_InterruptSend(data, num, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptReceive(void *data, uint32_t num)
{
    return DSPI_InterruptReceive(data, num, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return DSPI_InterruptTransfer(data_out, data_in, num, &DSPI1_InterruptDriverState);
}

static uint32_t DSPI1_InterruptGetCount(void)
{
    return DSPI_InterruptGetCount(&DSPI1_InterruptDriverState);
}

